<?php

/*
1. Создайте массив $arr=array('joomla', 'wordpress', 'netcat'). Выведите значение массива на экран с помощью команды var_dump().
*/

/*
$arr=array('joomla', 'wordpress', 'netcat');
var_dump($arr);
*/

//----------------------------------------------------------------------------------------------------

/*
2. С помощью массива $arr из предыдущего номера выведите на экран содержимое первого, второго и третьего элементов.
*/

/*
$arr=array('joomla', 'wordpress', 'netcat');
echo "$arr[0] $arr[1] $arr[2]";
*/

//----------------------------------------------------------------------------------------------------

/*
3. Создайте массив $arr=array('html', 'css', 'php') и с его помощью выведите на экран строку 'php, html, css'.
*/

/*
$arr=array('html', 'css', 'php');
echo "$arr[2], $arr[0], $arr[1]";
*/

//-----------------------------------------------------------------------------------------------------

/*
4. Создайте массив $arr с элементами 2, 5, 3, 9. Умножьте первый элемент массива на второй, 
а третий элемент на четвертый. Результаты сложите, присвойте переменной $result. Выведите на экран значение этой переменной.
*/

/*
$arr=array(2, 5, 3, 9);
$a= $arr[0] * $arr[1];
$b= $arr[2] * $arr[3];
$result= $a+$b;
print $result; 
*/

//-----------------------------------------------------------------------------------------------------

/*
5. Создайте массив $arr с элементами 'a', 'b', 'c', 78 двумя различными способами.
*/

$arr= array('a', 'b', 'c', 78);
print_r ($arr);
$arr = ['a', 'b', 'c', 78];
print_r ($arr)."<br />";

//-----------------------------------------------------------------------------------------------------

/*
6. Создайте массив $arr с элементами 'Я', 'учу', 'PHP', '!'. С его помощью выведите на экран фразу 'Я учу PHP!'.
*/

$arr=array('Я', 'учу', 'PHP', '!');
echo "$arr[0] $arr[1] $arr[2] $arr[3]"."<br />";


//-----------------------------------------------------------------------------------------------------

/*
7. Создайте массив $arr=array('a', 'b', 'c', 'd', 'e'). С помощью одной переменной $var поменяйте местами элементы 'b' и 'c'.
*/

$arr=array('a', 'b', 'c', 'd', 'e');
$var=$arr[2];
$arr[2]=$arr[1];
$arr[1]=$var;
print_r ($arr)."<br />";
echo "<br>";
//------------------------------------------------------------------------------------------------------

/*
8. Создайте массив $arr=array('a', 'b', 'c', 'd', 'e'). С помощью одной переменной $var сделайте из него массив array('e', 'd', 'c', 'b', 'a').
*/

$arr=array('a', 'b', 'c', 'd', 'e');
$var=$arr[0];
$arr[0]=$arr[4];
$arr[4]=$var;
$var=$arr[1];
$arr[1]=$arr[3];
$arr[3]=$var;
print_r ($arr)."<br />";
echo "<br>";


//------------------------------------------------------------------------------------------------------

/*
Ассоциативные массивы

1. Создайте массив $arr. Выведите значение массива на экран с помощью команды var_dump().
$arr = array('text'=>'текст!', 1=>'125', 'key'=>'element');
var_dump($arr);
*/

$arr = array('text'=>'текст!', 1=>'125', 'key'=>'element');
var_dump($arr)."<br />";


//------------------------------------------------------------------------------------------------------

/*
2. Создайте массив заработных плат $arr. Выведите на экран зарплату Пети и Коли.
$arr = array('Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$');
Из условия задачи выше поменяйте местами зарплаты Коли и Пети.
*/

$arr = array('Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$');
echo "$arr[Коля] $arr[Петя].<br>";
$var=$arr['Коля'];
$arr['Коля']=$arr['Петя'];
$arr['Петя']=$var;
echo "Поменяли зарплаты  ";
print_r ($arr)."<br />";
echo "<br>";

//------------------------------------------------------------------------------------------------------

/*
3. Создайте массив $arr с ключами 'I', 'study', 'php', 'sign' и соответствующими элементами 'Я', 'учу', 'PHP', '!'. 
С его помощью выведите на экран фразу 'Я учу PHP!'.
*/

$arr = array('I'=>'Я', 'study'=>'учу', 'php'=>'PHP', 'sign'=>'!');
echo "$arr[I] $arr[study] $arr[php] $arr[sign]"."<br />";

//-------------------------------------------------------------------------------------------------------

/*
Многомерные массивы

4. Создайте многомерный массив $arr. С его помощью выведите на экран слова 'joomla', 'drupal', 'зеленый', 'красный'.
$arr = array('cms'=>array('joomla','wordpress', 'drupal'), 'colors'=>array('blue'=>'голубой','red'=>'красный', 'green'=>'зеленый'));
*/

$arr = array('cms'=>array('joomla','wordpress', 'drupal'), 'colors'=>array('blue'=>'голубой','red'=>'красный', 'green'=>'зеленый'));
print_r ($arr);
echo "<br />". $arr['cms'][0].",", $arr['cms'][2]."<br />";
echo "<br />". $arr['colors']['green'].",", $arr['colors']['red']."<br />";
     


//-------------------------------------------------------------------------------------------------------

/*
5. Создайте двумерный массив. Первые два ключа — это 'ru' и 'en'. Первый ключ содержит элемент, являющийся массивом названий дней
 недели по-русски, а второй — по-английски.
 */
 
 $arr = array('ru'=>array('Понедельник','Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'), 'en'=>array(
 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'));
 print_r ($arr);
 


?>